In [9]:
import pandas as pd

df = pd.read_csv('examples/ex1.csv')

In [10]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [21]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
names = ['a', 'b', 'c', 'd', 'message']

pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [23]:
parsed = pd.read_csv('examples/csv_mindex.csv',
   ....:                      index_col=['key1', 'key2'])

parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [24]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [25]:
result = pd.read_table('examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [26]:
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
list(open('examples/ex5.csv'))

['something,a,b,c,d,message\n',
 'one,1,2,3,4,NA\n',
 'two,5,6,,8,world\n',
 'three,9,10,11,12,foo']

In [29]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [31]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [33]:
 pd.options.display.max_rows = 10

In [34]:
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [35]:
pd.read_csv('examples/ex6.csv',nrows=10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [39]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)
tot[:10]

key
E    368
X    364
L    346
O    343
Q    340
M    338
J    337
F    335
K    334
H    330
dtype: object

In [41]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
data.to_csv('examples/out.csv')

list(open('examples/out.csv'))

[',something,a,b,c,d,message\n',
 '0,one,1,2,3.0,4,\n',
 '1,two,5,6,,8,world\n',
 '2,three,9,10,11.0,12,foo\n']

In [45]:
data.to_csv('examples/out.csv',sep='$')

list(open('examples/out.csv'))

['$something$a$b$c$d$message\n',
 '0$one$1$2$3.0$4$\n',
 '1$two$5$6$$8$world\n',
 '2$three$9$10$11.0$12$foo\n']

In [46]:
import sys

data.to_csv(sys.stdout,sep='@')

@something@a@b@c@d@message
0@one@1@2@3.0@4@
1@two@5@6@@8@world
2@three@9@10@11.0@12@foo

In [47]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [48]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [49]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [50]:
dates = pd.date_range('1/1/2000', periods=7)

dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [52]:
import numpy as np

ts = pd.Series(np.arange(7), index=dates)

In [55]:
ts.to_csv('examples/tseries.csv')

list(open('examples/tseries.csv'))

[',0\n',
 '2000-01-01,0\n',
 '2000-01-02,1\n',
 '2000-01-03,2\n',
 '2000-01-04,3\n',
 '2000-01-05,4\n',
 '2000-01-06,5\n',
 '2000-01-07,6\n']

In [56]:
import csv
f = open('examples/ex7.csv')

reader = csv.reader(f)

In [57]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [58]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [59]:
header, values = lines[0], lines[1:]

In [60]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [61]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

ValueError: I/O operation on closed file.

In [63]:
f = open('examples/ex7.csv')
reader = csv.reader(f, delimiter='|')

In [64]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [65]:
import json

obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [66]:
asjson = json.dumps(result)

In [67]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

siblings

    name  age
0  Scott   30
1  Katie   38

In [68]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [69]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [70]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [9]:
import pandas as pd
import numpy as np
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [10]:
failures = tables[0]
close_timestamps = pd.to_datetime(failures['Closing Date'])

close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

In [2]:
import pandas as pd
import numpy as np

frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
frame.to_pickle('examples/frame_pickle')

In [4]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
frame = pd.DataFrame({'a': np.random.randn(100)})

store = pd.HDFStore('mydata.h5')

In [1]:
import sys

sys.path

['H:\\CVLearingRes\\code\\py-code',
 'D:\\DevResources\\python3\\python311.zip',
 'D:\\DevResources\\python3\\DLLs',
 'D:\\DevResources\\python3\\Lib',
 'D:\\DevResources\\python3',
 '',
 'C:\\Users\\ROG-LiBai\\AppData\\Roaming\\Python\\Python311\\site-packages',
 'D:\\DevResources\\python3\\Lib\\site-packages',
 'D:\\DevResources\\python3\\Lib\\site-packages\\win32',
 'D:\\DevResources\\python3\\Lib\\site-packages\\win32\\lib',
 'D:\\DevResources\\python3\\Lib\\site-packages\\Pythonwin']

In [6]:
import pandas as pd
import numpy as np

xlsx = pd.ExcelFile('examples/ex1.xlsx')

pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [13]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [15]:
from lxml import objectify

path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [16]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [17]:
perf = pd.DataFrame(data)

perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [18]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [19]:
root

In [20]:
root.get('href')

'http://www.google.com'

In [21]:
root.text

'Google'

In [22]:
frame = pd.read_csv('examples/ex1.csv')

In [23]:
frame = pd.DataFrame({'a': np.random.randn(100)})

store = pd.HDFStore('mydata.h5')

store['obj1'] = frame

store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [24]:
store['obj1']

           a
0   0.776678
1  -1.496291
2   0.721341
3  -0.608490
4  -2.763987
..       ...
95  0.772517
96 -2.632889
97  0.295225
98 -0.596045
99 -0.936340

[100 rows x 1 columns]

In [25]:
store.put('obj2', frame, format='table')

store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.487688
11  0.330024
12  1.287583
13  0.868610
14  0.100969
15 -0.477955

In [26]:
store.select('obj2', where=['index >= 10 and index <= 15'])

pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

ValueError: The file 'mydata.h5' is already opened, but not in read-only mode (as requested).

In [27]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [29]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [33]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

frame.to_excel(writer, 'Sheet1')

writer.close()

In [34]:
frame.to_excel('examples/ex2.xlsx')

In [35]:
import requests

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

resp = requests.get(url)

resp

In [36]:
data = resp.json()

data[0]['title']

'DOC: Update read_csv docs to reflect behaviour with `parse_dates`'

In [37]:
issues = pd.DataFrame(data, columns=['number', 'title',
   .....:                                      'labels', 'state'])
issues

,number,title,labels,state
0,55176,DOC: Update read_csv docs to reflect behaviour...,[],open
1,55175,DEPS: Bump to 1.26 proper for Python 3.12,"[{'id': 527603109, 'node_id': 'MDU6TGFiZWw1Mjc...",open
2,55174,DEPR: Index.where and Index.putmask,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,55173,BUG: .rolling() returns incorrect values when ...,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
4,55172,complete parameter descriptions for DataFrame....,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
5,55171,ENH: set __module__ for objects in pandas pd.D...,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
6,55170,BUILD:,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
7,55169,BUG: Pandas column rename function now working...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,55168,Fix for series boolean documentation,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
9,55167,Add env markers for pytables. Allow multiple o...,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
10,55166,xAdded 2 alternative examples for DataFrame.la...,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
11,55165,DOC: fix pandas.DataFrame.agg.html and pandas....,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
12,55164,DOCS: Unpin pydata-sphinx-theme,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
13,55163,DOC: fix the dev version label in the version...,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
14,55162,DOC: fix pandas.DataFrame.agg.html documents,"[{'id': 4851593007, 'node_id': 'LA_kwDOAA0YD88...",open
15,55160,DOC: fix the dev version label in the version...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
16,55158,DOC: Document that passing date_format=... to ...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
17,55157,Update __init__.py,[],open
18,55155,CLN: de-duplicate code in _matplotlib.converter,[],open
19,55153,BUG: Fix weighted rolling variance implementation,[],open
20,55152,CLN: Add is_hashable_non_slice,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
21,55151,Refactor npy_datetimestruct_to_datetime,[],open
22,55150,Replace cpplint with clang-format,[],open
23,55149,docs: add explanation about `freq` units in `T...,[],open
24,55147,DEPR/API: Series[categorical].replace behavior,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
25,55145,ENH: pearson correlation with population mean,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
26,55144,BUG: No keyword arguments passed to numpy.interp,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,55142,BUG: DataFrame.explode() does not gracefully h...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,55141,BUG: setting tuple key on Series with flat Index,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,55140,BUG: Inconsistent Series constructor behavior ...,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open

In [43]:
import sqlite3

query = "CREATE TABLE test1(a VARCHAR(20), b VARCHAR(20),c REAL,d INTEGER);"
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [45]:
con.commit()

In [46]:
data = [('Atlanta', 'Georgia', 1.25, 6),
   .....:         ('Tallahassee', 'Florida', 2.6, 3),
   .....:         ('Sacramento', 'California', 1.7, 5)]

In [47]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [48]:
con.executemany(stmt, data)

In [49]:
cursor = con.execute('select * from test')

In [50]:
rows = cursor.fetchall()

rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [51]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [52]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [55]:
import sqlalchemy as sqla

db = sqla.create_engine('sqlite:///mydata.sqlite')

pd.read_sql('select * from test1', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []